cask_args appdir: "/Applications"

# Taps
tap 'caskroom/cask'
tap 'caskroom/eid'
tap 'caskroom/fonts'
tap 'caskroom/versions'
tap 'homebrew/bundle'
tap 'mas-cli/tap', pin: true

# Binaries
brew 'bat'
brew 'coreutils'
brew 'git'
brew 'grep'
brew 'mas'
brew 'trash'
brew 'jenv'
brew 'pyenv'
brew 'zplug'

# Apps
cask 'aerial'
cask 'google-chrome'
cask 'insomnia'
cask 'java'
cask 'slack'
cask 'vagrant'
cask 'virtualbox'
cask 'virtualbox-extension-pack'
cask 'docker'
cask 'jetbrains-toolbox'
cask 'iterm2'
cask 'visual-studio-code'
cask 'clipy'
cask 'spectacle'

# Quicklook
cask 'qlcolorcode'
cask 'qlmarkdown'
cask 'quicklook-json'
cask 'quicklook-csv'
cask 'qlstephen'

# Fonts
cask 'font-lato'
cask 'font-open-sans'
cask 'font-roboto'
cask 'font-source-code-pro-for-powerline'
cask 'font-source-code-pro'
cask 'font-source-sans-pro'
cask 'font-source-serif-pro'

# Mac App Store
mas 'Things 3', id: 904280696 
mas 'Bear', id: 1091189122
mas 'Kindle', id: 405399194
mas 'Notability', id: 736189492

